function [X, Y, Z] = EilerModifiedMethod(a, b, N, stPy, stPz)
% Функция для приближения модифицированным методом Эйлера

% a - начало отрезка
% b - конец отрезка
% N - количество отрезков разбиения
% stPy, stPz - начальные условия, то есть значения Y и Z в точке X=a

h = abs(b-a)/N; % Расстояние между узлами
X = a:h:b; % Формируем вектор X узловых точек
Y = X * 0; % Формируем пока еще пустой вектор Y
Z = Y; % Формируем пока пустой вектор Z

% Подставляем начальные условия:
Y(1) = stPy;
Z(1) = stPz;

% Начинаем обходить последовательно все точки и вычисляем значения на
% текущем шаге исходя из данных предыдущего шага:
for i = 2 : N+1
    
    Xp = X(i-1) + h/2;
    Yp = Y(i-1) + h/2 * F1(X(i-1), Y(i-1), Z(i-1)); % первое приближение
    Zp = Z(i-1) + h/2 * F2(X(i-1), Y(i-1), Z(i-1)); % первое приближение    
    
    Y(i) = Y(i-1) + h * F1(Xp, Yp, Zp); % уточнение
    Z(i) = Z(i-1) + h * F2(Xp, Yp, Zp); % уточнение
    
end

end