function [X, Y, Z] = EilerImplicitMethod(a, b, N, stPy, stPz)
% Функция для приближения неявным методом Эйлера

% a - начало отрезка
% b - конец отрезка
% N - количество отрезков разбиения
% stPy, stPz - начальные условия, то есть значения Y и Z в точке X=a

h = abs(b-a)/N; % Расстояние между узлами
X = a:h:b; % Формируем вектор X узловых точек

% Используем встроенную функцию неявного метода, она возвращает два массива:
% в первом - значения X, во втором - столбцы решений Y и Z для этих X
[X, Y]=ode15s('F3',X,[stPy,stPz]); % <- подставляем начальные условия

Z = Y(:, 2); % Вытаскиваем второй столбец
Y = Y(:, 1); % и первый столбец
end