function [X, Y, Z] = Adams2ExplicitMethod(a, b, N, stPy, stPz)
% Функция для приближения явным методом Адамса 2 порядка (марш) со стартом
% исправленным методом Эйлера

% a - начало отрезка
% b - конец отрезка
% N - количество отрезков разбиения
% stPy, stPz - начальные условия, то есть значения Y и Z в точке X=a

h = abs(b-a)/N; % Расстояние между узлами

% Для старта используем исправленный метод Эйлера:
[X, Y, Z] = EilerCorrectedMethod(a, b, N, stPy, stPz);

% Но нам нужны только первые две точки оттуда, все остальное перезапишем
% вычислениями марша явного метода Адамса:

% Начинаем обходить последовательно все точки и вычисляем значения на
% текущем шаге исходя из данных двух предыдущих шагов:
for i = 2 : N
    Y(i+1) = Y(i) + h * ( 3/2*F1(X(i), Y(i), Z(i)) - 1/2*F1(X(i-1), Y(i-1), Z(i-1)) );
    Z(i+1) = Z(i) + h * ( 3/2*F2(X(i), Y(i), Z(i)) - 1/2*F2(X(i-1), Y(i-1), Z(i-1)) );           
end

end